glcloud/keil_v5/ARM/PACK/.Web/Keil.STM32MP1xx_DFP.pdsc
        </sequences>

        <!-- Debug access ports -->
        <debug Pname="Cortex-A7" Punit="0" __dp="0" __ap="1" address="0xE00D0000"/>
        <debug Pname="Cortex-A7" Punit="1" __dp="0" __ap="1" address="0xE00D2000"/>
        <debug Pname="Cortex-M4"           __dp="0" __ap="2" address="0xE000ED00"/>

        <!-- Memory adresses -->
        <memory  Pname="Cortex-M4" id="IROM1" start="0x10000000" size="0x00020000" startup="1" default="1"/> <!-- SRAM1 -->
        <memory  Pname="Cortex-M4" id="IRAM1" start="0x10020000" size="0x00020000" init   ="0" default="1"/> <!-- SRAM2 -->
        <memory  Pname="Cortex-M4" id="IRAM2" start="0x10040000" size="0x00020000" init   ="0" default="0"/> <!-- SRAM3 -->

        <!-- SVD -->
        <debug svd="SVD/STM32MP1.svd"/>
        <compile Pname="Cortex-M4" Pdefine="CORE_CM4"/>
        <compile Pname="Cortex-A7" Pdefine="CORE_CA7"/>

        <!-- Device properties, header files and preprocessor defines -->
        <device Dname="STM32MP157AADx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157axx_cm4.h" define="STM32MP157Axx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157axx_ca7.h" define="STM32MP157Axx"/>
        </device>
        <device Dname="STM32MP157AABx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157axx_cm4.h" define="STM32MP157Axx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157axx_ca7.h" define="STM32MP157Axx"/>
        </device>
        <device Dname="STM32MP157AACx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157axx_cm4.h" define="STM32MP157Axx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157axx_ca7.h" define="STM32MP157Axx"/>
        </device>
        <device Dname="STM32MP157AAAx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157axx_cm4.h" define="STM32MP157Axx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157axx_ca7.h" define="STM32MP157Axx"/>
        </device>
        <device Dname="STM32MP157CADx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157cxx_cm4.h" define="STM32MP157Cxx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157cxx_ca7.h" define="STM32MP157Cxx"/>
        </device>
        <device Dname="STM32MP157CABx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157cxx_cm4.h" define="STM32MP157Cxx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157cxx_ca7.h" define="STM32MP157Cxx"/>
        </device>
        <device Dname="STM32MP157CACx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157cxx_cm4.h" define="STM32MP157Cxx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157cxx_ca7.h" define="STM32MP157Cxx"/>
        </device>
        <device Dname="STM32MP157CAAx">
          <compile Pname="Cortex-M4" header="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp157cxx_cm4.h" define="STM32MP157Cxx"/>
          <compile Pname="Cortex-A7" header="MDK/Device/Include/stm32mp157cxx_ca7.h" define="STM32MP157Cxx"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32MP157">
      <description>STMicroelectronics STM32MP157 Device </description>
      <require Dvendor="STMicroelectronics:13"/>
      <accept  Dname="STM32MP157*"/>
    </condition>

    <condition id="STM32MP157 M4">
      <description>STMicroelectronics STM32MP157 Device </description>
      <require Dvendor="STMicroelectronics:13"/>
      <accept  Dname="STM32MP157*"/>
      <require Dcore="Cortex-M4"/>
    </condition>

    <condition id="STM32MP157 A7">
      <description>STMicroelectronics STM32MP157 A7 Device </description>
      <require Dvendor="STMicroelectronics:13"/>
      <accept  Dname="STM32MP157*"/>
      <require Dcore="Cortex-A7"/>
    </condition>

    <condition id="STM32MP157 M4 CMSIS">
      <description>STMicroelectronics STM32MP157 Device and CMSIS-CORE</description>
      <require condition="STM32MP157 M4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32MP157 A7 CMSIS">
      <description>STMicroelectronics STM32MP157 A7 Device and CMSIS-CORE</description>
      <require condition="STM32MP157 A7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    
    <condition id="STM32MP157 HAL Common">
      <description>STMicroelectronics STM32MP157 Device and HAL Common</description>
      <require condition="STM32MP157"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <!--require Cclass="Device" Cgroup="STM32Cube Framework"/-->
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
    </condition>

    <condition id="STM32MP157 HAL GPIO">
      <description>STMicroelectronics STM32MP157 Device and HAL with GPIO</description>
      <require condition="STM32MP157"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>

    <condition id="STM32MP157 HAL GPIO BSP">
      <description>STMicroelectronics STM32MP157 Device and HAL with GPIO</description>
      <require condition="STM32MP157"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="BSP"/>
    </condition>

