glcloud/keil_v5/ARM/PACK/.Web/Keil.STM32MP1xx_DFP.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LPTIM" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Low Power Timer (LPTIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_lptim.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDIOS" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Management data input/output (MDIOS) slave HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MDIOS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_mdios.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDMA" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Master DMA controller (MDMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MDMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_mdma.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Power controller (PWR) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_pwr.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_pwr_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Quad Serial peripheral interface (QSPI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_QSPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_qspi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Reset and clock control (RCC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_rcc.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_rcc_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RNG" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Random number generator (RNG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RNG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_rng.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Serial audio interface (SAI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SAI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_sai.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_sai_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Secure Digital (SD) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_sd.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_sd_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SMBUS" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>System management bus (SMBUS) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SMBUS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_smbus.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPDIFRX" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>SPDIF Receiver interface (SPDIFRX) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SPDIFRX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_spdifrx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPI" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Serial Peripheral interface (SPI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_spi.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_spi_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Timer (TIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_TIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_tim.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_tim_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Universal asynchronous receiver transmitter (UART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_UART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_uart.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_uart_ex.c"/>
      </files>
    </component>

