glcloud/keil_v5/ARM/PACK/.Web/Keil.STM32MP1xx_DFP.pdsc
    <example name="OpenAMP_TTY_echo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32MP157C-EV1/OpenAMP_TTY_echo">
      <description>OpenAMP TTY echo example</description>
      <board name="STM32MP157C-EV1" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="OpenAMP_TTY_echo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
    <example name="OpenAMP_TTY_echo_DS" doc="Abstract.txt" folder="MDK/Boards/ST/STM32MP157C-EV1/OpenAMP_TTY_echo_DS">
      <description>OpenAMP_TTY_echo example for Arm DS</description>
      <board name="STM32MP157C-EV1" vendor="STMicroelectronics"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  
    <example name="AI_Character_Recognition" doc="Abstract.txt" folder="MDK/Boards/ST/STM32MP157C-EV1/AI_Character_Recognition">
      <description>AI Character Recognition example</description>
      <board name="STM32MP157C-EV1" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="AI_Character_Recognition.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
    <example name="AI_Character_Recognition_DS" doc="Abstract.txt" folder="MDK/Boards/ST/STM32MP157C-EV1/AI_Character_Recognition_DS">
      <description>AI Character Recognition example for Arm DS</description>
      <board name="STM32MP157C-EV1" vendor="STMicroelectronics"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS2 Blinky A7 AC6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32MP157C-EV1/Blinky_A7_RTX5_AC6">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-A7 and ArmCC6</description>
      <board name="STM32MP157C-EV1" vendor="STMicroelectronics"/>
      <project>
        <environment name="ds5" load=".project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
  
</package>
